app/controllers/admin/balances_controller.rb

	def index
		@balances = Balance.all
---
SELECT `balances`.* FROM `balances`