app/controllers/admin/clicks_controller.rb

	def index
		@clicks = Click.all
---
SELECT `clicks`.* FROM `clicks`