app/controllers/admin/packages_controller.rb

SELECT `packages`.* FROM `packages`
---
	def index
		@packages = Package.all