app/controllers/admin/pages_controller.rb

SELECT `pages`.* FROM `pages`
---
	def index
		@pages = Page.all