app/controllers/admin/rewards_controller.rb

SELECT `rewards`.* FROM `rewards`
---
  def index
    @rewards = Reward.all