app/controllers/admin/withdraws_controller.rb

	def index
		@withdraws = Withdraw.all
---
SELECT `withdraws`.* FROM `withdraws`