app/controllers/user/clicks_controller.rb

  def index
    @clicks = current_user.clicks.includes(:page)
---
SELECT COUNT(*) FROM `clicks` WHERE `clicks`.`user_id` = 2
SELECT `clicks`.* FROM `clicks` WHERE `clicks`.`user_id` = 2