app/controllers/user/orders_controller.rb

  def index
    @orders = current_user.orders
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 2

  def create
    @order = current_user.orders.build(params[:order])
    if @order.save
---
INSERT INTO `orders` (`created_at`, `gateway`, `package_id`, `paid`, `return`, `updated_at`, `user_id`, `value`) VALUES ('2013-08-24 19:11:44', 'pagseguro', 2, 0, NULL, '2013-08-24 19:11:44', 2, NULL)