app/views/user/_subnav.html.slim

SELECT `categories`.* FROM `categories` WHERE `categories`.`active` = 1
---
nav.sub-nav
  - Category.active.each do |category|