app/controllers/user_controller.rb

SELECT COUNT(*) FROM `clicks` WHERE `clicks`.`user_id` = 2 AND `clicks`.`page_id` = 1
SELECT `clicks`.* FROM `clicks` WHERE `clicks`.`page_id` IN (1, 2, 3, 4, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87)
SELECT `pages`.* FROM `pages` WHERE `pages`.`published` = 1 AND (user_id != 2)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def index
    @pages = Page.published.where('user_id != ?', current_user.id).includes(:user, :clicks)